tutorials/combustion/coldEngineFoam/freePiston/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#inputSyntax slash;

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    back
    {
        type            wedge;
    }

    front
    {
        $back;
    }

    liner
    {
        $include/caseSettings!wall/alphat;
    }

    cylinderHead
    {
        $liner;
    }

    piston
    {
        $liner;
    }
}


// ************************************************************************* //
